Repository: fangjunyu1/ImageSlim
Catalog: ImageSlim/Languages/Localizable.xcstrings
Source language: en
Languages: ar, zh_hans

source: About
ar: عن
zh_hans: 关于

source: Acknowledgements
ar: الشكر والتقدير
zh_hans: 鸣谢

source: Always show
ar: دائما على الشاشة
zh_hans: 始终显示

source: Application
ar: برنامج
zh_hans: 应用程序

source: Balanced
ar: متوازن
zh_hans: 均衡

source: Because of you, we can insist on bringing good tools to more people
ar: بفضلك، يمكننا الاستمرار في توفير الأدوات الجيدة لعدد أكبر من الأشخاص.
zh_hans: 因为你，我们才能坚持把好工具带给更多人

source: Clear the queue
ar: مسح قائمة الانتظار
zh_hans: 清除队列

source: Compression
ar: ضغط
zh_hans: 压缩

source: Compression failed
ar: فشل الضغط
zh_hans: 压缩失败

source: Desktop directory
ar: دليل سطح المكتب
zh_hans: 桌面目录

source: Develop motivation to work overtime late at night
ar: تطوير الدافع للعمل في وقت متأخر من الليل
zh_hans: 开发深夜加班的动力

source: Document directory
ar: دليل المستندات
zh_hans: 文稿目录

source: Don't let developers starve to death in Xcode
ar: لا تدع المطورين يموتون جوعًا في Xcode
zh_hans: 不让开发者饿死在Xcode里

source: Download
ar: تحميل
zh_hans: 下载

source: Download All
ar: تنزيل الكل
zh_hans: 下载全部

source: Download Complete
ar: تم التحميل بالكامل
zh_hans: 下载完成

source: Download directory
ar: تنزيل الكتالوج
zh_hans: 下载目录

source: Email feedback
ar: ملاحظات البريد الإلكتروني
zh_hans: 邮件反馈

source: Enable third-party library compression
ar: تمكين ضغط مكتبة الطرف الثالث
zh_hans: 启用第三方库压缩

source: Give someone a rose, and the fragrance will linger on your hands
ar: إهداء الورود للآخرين يترك رائحة طيبة على يديك
zh_hans: 赠人玫瑰，手有余香

source: High Quality
ar: جودة عالية
zh_hans: 高品质

source: Image compression rate
ar: معدل ضغط الصورة
zh_hans: 图片压缩率

source: Image directory
ar: كتالوج الصور
zh_hans: 图片目录

source: Image preview method
ar: وضع معاينة الصورة
zh_hans: 图片预览方式

source: Image save directory
ar: دليل تخزين الصور
zh_hans: 图片保存目录

source: Issue feedback
ar: تعليقات على الأسئلة
zh_hans: 问题反馈

source: Lossless
ar: بدون خسارة
zh_hans: 无损

source: Low Quality
ar: جودة منخفضة
zh_hans: 低品质

source: Lowest
ar: أدنى
zh_hans: 最低

source: Mac native compression
ar: ضغط أصلي لنظام Mac
zh_hans: Mac原生压缩

source: Number of uploaded pictures
ar: عدد الصور المرفوعة
zh_hans: 上传图片数量

source: Off
ar: إنهاء
zh_hans: 关闭

source: Open
ar: يفتح
zh_hans: 打开

source: Open source
ar: مفتوح المصدر
zh_hans: 开源

source: Open source image compression tool
ar: أداة ضغط الصور مفتوحة المصدر
zh_hans: 开源压缩图片工具

source: Privacy policy
ar: سياسة الخصوصية
zh_hans: 隐私政策

source: Public directory
ar: الدليل العام
zh_hans: 公共目录

source: Quit
ar: يترك
zh_hans: 退出

source: Release the file and add compression
ar: حرر الملف وأضف الضغط
zh_hans: 释放文件，添加压缩

source: Restore in-app purchases
ar: استعادة عمليات الشراء داخل التطبيق
zh_hans: 恢复内购

source: Select up to 20 pictures, each no larger than 5MB.
ar: قم باختيار ما يصل إلى 20 صورة، بحيث لا يتجاوز حجم كل صورة 5 ميجا بايت.
zh_hans: 最多选择 20 张图片，每张大小不超过 5MB。

source: Settings
ar: يثبت
zh_hans: 设置

source: Show icon in menu bar
ar: إظهار الرمز في شريط القائمة
zh_hans: 在菜单栏中显示图标

source: Sponsor Us
ar: ارعنا
zh_hans: 赞助我们

source: Sponsor us a book
ar: ارعى لنا كتابًا
zh_hans: 赞助我们一本书

source: Sponsor us a burger
ar: ارعى لنا برجر
zh_hans: 赞助我们一个汉堡

source: Sponsor us a cup of coffee
ar: تكفل لنا بفنجان من القهوة
zh_hans: 赞助我们一杯咖啡

source: Sponsorship List
ar: قائمة الرعاية
zh_hans: 赞助列表

source: Sponsorship success
ar: نجاح الرعاية
zh_hans: 赞助成功

source: Support our open source business
ar: ادعم عملنا مفتوح المصدر
zh_hans: 支持我们的开源事业

source: Supports multiple formats including .png, .jpeg, .bmp, .tiff, etc.
ar: يدعم صيغًا متعددة مثل .png، .jpeg، .bmp، .tiff، إلخ.
zh_hans: 支持 .png, .jpeg, .bmp, .tiff 等多种格式。

source: Terms of use
ar: شروط الاستخدام
zh_hans: 使用条款

source: Thank you for your support
ar: شكرا لدعمكم
zh_hans: 感谢您的支持

source: This sponsorship project is a one-time consumable in-app purchase. It only unlocks the upload limit when you purchase it for the first time. The service will not be repeated in the future, and it does not support recovery.
ar: مشروع الرعاية هذا عبارة عن عملية شراء داخل التطبيق لمرة واحدة. سيتم فتح حد التحميل فقط عند الشراء الأول. لن تُتاح الخدمة مجددًا لاحقًا، ولا يُدعم استعادتها.
zh_hans: 该赞助项目为一次性消耗型内购，仅在首次购买时解锁上传限制，后续不再重复提供服务，也不支持恢复。

source: Upload pictures and compress them instantly
ar: تحميل الصور وضغطها على الفور
zh_hans: 上传图片，即刻压缩

source: Use Quick Look to preview
ar: معاينة مع نظرة سريعة
zh_hans: 使用 Quick Look 预览

source: Waiting for compression
ar: في انتظار الضغط
zh_hans: 等待压缩

source: We may be able to solve the next problem with it
ar: ربما نتمكن من استخدامه لحل المشكلة التالية
zh_hans: 我们也许能靠它解决下一个问题

source: Web page (Chinese)
ar: الموقع الإلكتروني (باللغة الصينية)
zh_hans: 网页（中文）

source: Window preview
ar: معاينة النافذة
zh_hans: 窗口预览

source: Your support keeps free software alive.
ar: دعمك يحافظ على بقاء البرمجيات الحرة على قيد الحياة.
zh_hans: 您的支持让自由软件不止于理想。
